Revit 2027 API
BuiltInFailures.StairRampFailures.StairsGenericFailure Property
 Stairs generic failure
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsGenericFailure { get; }
Public Shared ReadOnly Property StairsGenericFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsGenericFailure {
	FailureDefinitionId^ get ();
}
static member StairsGenericFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace